app/controllers/api/v1/applications_controller.rb

INSERT INTO `applications` (`name`, `number`, `created_at`, `updated_at`) VALUES ('khaled appp', '5861787681', '2021-03-12 15:53:26.705793', '2021-03-12 15:53:26.705793')
---
    def create
      application = Application.new(application_params)

      unless application.save

UPDATE `applications` SET `applications`.`name` = 'app 7 edited', `applications`.`updated_at` = '2021-03-08 22:06:28.220109' WHERE `applications`.`id` = 7
---
    def update
      unless @application.update(application_params)

SELECT `applications`.* FROM `applications` WHERE `applications`.`number` = '9572947751' LIMIT 1
---
    def set_application
      @application = Application.find_by(number: params[:token])