app/controllers/api/v1/chats_controller.rb

INSERT INTO `chats` (`application_id`, `number`, `created_at`, `updated_at`) VALUES (7, '256651156', '2021-03-08 22:37:02.487551', '2021-03-08 22:37:02.487551')
---
    def create
      creation_response = ChatCreationService.create_chat(@application)

SELECT `applications`.* FROM `applications` WHERE `applications`.`number` = '2163110743' LIMIT 1
---
    def set_application
      @application = Application.find_by!(number: params[:application_token])