app/controllers/api/v1/messages_controller.rb

INSERT INTO `messages` (`text`, `created_at`, `updated_at`, `chat_id`) VALUES ('3 message', '2021-03-10 06:52:20.676735', '2021-03-10 06:52:20.676735', 1)
---
    def create
      begin
        creation_response = MessageCreationService.create_message(@chat, message_params[:text])