app/controllers/api/v1/messages_controller.rb

SELECT `messages`.* FROM `messages` WHERE `messages`.`chat_id` = 1
---
    def index
      messages = if params[:keyword].present?
                   @chat.messages.search(params[:keyword])

SELECT `applications`.* FROM `applications` WHERE `applications`.`number` = '5861787681' LIMIT 1
---
    def set_application
      @application = Application.find_by(number: params[:application_token])

SELECT `chats`.* FROM `chats` WHERE `chats`.`application_id` = 1 AND `chats`.`number` = '3' LIMIT 1
---
    def set_chat
      @chat = @application.chats.find_by(number: params[:chat_id])