app/models/chat.rb

UPDATE `applications` SET `applications`.`chats_count` = COALESCE(`applications`.`chats_count`, 0) + 1 WHERE `applications`.`id` = 1
---
  def increment_chats_counter
    application.with_lock do
      application.increment!(:chats_count)