app/models/message.rb

UPDATE `chats` SET `chats`.`messages_count` = COALESCE(`chats`.`messages_count`, 0) + 1 WHERE `chats`.`id` = 1
---
  def increment_messages_counter
    chat.with_lock do
      chat.increment!(:messages_count)