app/jobs/chat_creation_job.rb

  def perform(application_id:)
    chat = Chat.new(application_id: application_id)

    chat_saved = chat.save
---
INSERT INTO `chats` (`application_id`, `number`, `created_at`, `updated_at`) VALUES (1, '6226636570', '2021-03-10 08:08:50.153235', '2021-03-10 08:08:50.153235')