app/jobs/message_creation_job.rb

  def perform(chat_id:, text:, number:)
    message = Message.new(chat_id: chat_id, text: text, number: number)

    message_saved = message.save
---
INSERT INTO `messages` (`text`, `created_at`, `updated_at`, `chat_id`) VALUES ('{\"text\"=>\"dasdas message\"}', '2021-03-10 08:25:34.834163', '2021-03-10 08:25:34.834163', 1)